super_powers/app/controllers/super_powers_controller.rb

    def index
        @super_powers = SuperPower.all
---
SELECT "super_powers".* FROM "super_powers"

    def show
        @super_power = SuperPower.find(params[:id])
---
SELECT "super_powers".* FROM "super_powers" WHERE "super_powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @super_power = SuperPower.create(super_powers_params(:name, :reason, :rating, :already_exists, :img_url))
---
INSERT INTO "super_powers" ("name", "reason", "rating", "already_exists", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Flight"], ["reason", "dwdwd"], ["rating", 3], ["already_exists", 1], ["created_at", "2020-12-14 18:43:43.126084"], ["updated_at", "2020-12-14 18:43:43.126084"]]

    def edit
        @super_power = SuperPower.find(params[:id])
---
SELECT "super_powers".* FROM "super_powers" WHERE "super_powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @super_power = SuperPower.find(params[:id])
        @super_power.update(super_powers_params(:reason, :rating))
---
SELECT "super_powers".* FROM "super_powers" WHERE "super_powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "super_powers" SET "reason" = ?, "updated_at" = ? WHERE "super_powers"."id" = ?  [["reason", "Pros: Go anywhere instantly\r\nCons: Could teleport to dangerous situation."], ["updated_at", "2020-12-14 05:50:29.721218"], ["id", 2]]

    def destroy
        @super_power = SuperPower.find(params[:id])
        @super_power.destroy
---
SELECT "super_powers".* FROM "super_powers" WHERE "super_powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "super_powers" WHERE "super_powers"."id" = ?  [["id", 1]]