super_powers/app/views/super_powers/show.html.erb

<% array = [] %>
<% SuperPower.all.map do |superpower| %>
---
SELECT "super_powers".* FROM "super_powers"